polybassa/WyLight/cc3200/example/camera_application/camera_app.c
        LOOP_FOREVER(__LINE__);
    }

    UART_PRINT("Device is configured in default state \n\r");  
  
  
    //
    // Connect to Network - AP Mode  
    //  
    ConnectToNetwork();
    //
    // Camera Controller and Camera Sensor Init  
    //      
    InitCameraComponents();

    #ifdef ENABLE_JPEG
        //
        // Configure Sensor in Capture Mode
        //
        StartSensorInJpegMode();
    #endif  
    //
    // Waits in the below loop till Capture button is pressed
    //
    do
    {
        while(g_CaptureImage)
        {
            CaptureImage();
            g_CaptureImage = 0;
        }
    }while(1);
}
//*****************************************************************************
//
//!     InitCameraComponents 
//!     PinMux, Camera Initialization and Configuration   
//!
//!	\param                      None  
//!     \return                     None           
//
//*****************************************************************************

static void InitCameraComponents()
{
    //
    // Configure device pins
    //
    PinMuxConfig();
    //
    // Initialize I2C Interface
    //   
    I2CInit();
    //
    // Initialize camera controller
    //
    CamControllerInit();
    //
    // Initialize camera sensor
    //
    CameraSensorInit();
}

//*****************************************************************************
//
//!     CaptureImage 
//!     Configures DMA and starts the Capture. Post Capture writes to SFLASH 
//!    
//!	\param                      None  
//!     \return                     None
//!                               
//
//*****************************************************************************

static void CaptureImage()
{
    long lFileHandle;
    unsigned long ulToken;
    int iRetVal;
    unsigned char *p_header;  
    //
    // Configure DMA in ping-pong mode
    //
    DMAConfig();
    
    //
    // Perform Image Capture 
    //
    MAP_CameraCaptureStart(CAMERA_BASE);
    while(g_frame_end == 0)
        ;
    MAP_CameraCaptureStop(CAMERA_BASE, true);
    //
    // NVMEM File Open to write to SFLASH
    //
    iRetVal = sl_FsOpen((unsigned char *)USER_FILE_NAME,
    FS_MODE_OPEN_CREATE(65535,_FS_FILE_OPEN_FLAG_COMMIT|_FS_FILE_PUBLIC_WRITE),
                        &ulToken,
                        &lFileHandle);
    //
    // Error handling if File Operation fails
    //
    if(iRetVal < 0)
    {
        iRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
    }
    //
    // Close the created file
    //
    iRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
    //
    // Open the file for Write Operation
    //
    iRetVal = sl_FsOpen((unsigned char *)USER_FILE_NAME,
                        FS_MODE_OPEN_WRITE,
                        &ulToken,
                        &lFileHandle);
    //
    // Error handling if File Operation fails
    //
    if(iRetVal < 0)
    {
        iRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
    }
    //
    // Create JPEG Header
    //
#ifdef ENABLE_JPEG
    memset(g_header, '\0', sizeof(g_header));
    g_header_length = CreateJpegHeader((char *)&g_header[0], PIXELS_IN_X_AXIS,
                                       PIXELS_IN_Y_AXIS, 0, 0x0020, 9);

    //
    // Write the Header 
    //
    p_header = (unsigned char *)&g_header[0];
    iRetVal = sl_FsWrite(lFileHandle, 0, p_header, g_header_length - 1);
    //
    // Error handling if file operation fails
    //
    if(iRetVal < 0)
    {
        iRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
    }
#endif
    //
    // Write the Image Buffer 
    //
    iRetVal =  sl_FsWrite(lFileHandle, g_header_length - 1,
                      (unsigned char *)g_image_buffer, g_frame_size_in_bytes);        
    //
    // Error handling if file operation fails
    //
    if (iRetVal <0)
    {
             iRetVal = sl_FsClose(lFileHandle, 0, 0, 0);                  
    }
    //
    // Close the file post writing the image
    //
    iRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
}
//*****************************************************************************
//
//!     DMA Config
//!     Initialize the DMA and Setup the DMA transfer
//!    
//!	\param                      None  
//!     \return                     None                  
//
//*****************************************************************************
static void DMAConfig()
{
    memset(g_image_buffer,0xF80F,sizeof(g_image_buffer));
    p_buffer = &g_image_buffer[0];
    //
    // Initilalize DMA 
    //
    UDMAInit();
    //
    // Setup ping-pong transfer
    //
    DMASetupTransfer(UDMA_CH22_CAMERA,UDMA_MODE_PINGPONG,TOTAL_DMA_ELEMENTS,
                     UDMA_SIZE_32,
                     UDMA_ARB_8,(void *)CAM_BUFFER_ADDR, UDMA_SRC_INC_32,
                     (void *)p_buffer, UDMA_DST_INC_32);
    //
    //  Pong Buffer
    // 
    p_buffer += TOTAL_DMA_ELEMENTS; 
    DMASetupTransfer(UDMA_CH22_CAMERA|UDMA_ALT_SELECT,UDMA_MODE_PINGPONG,
                     TOTAL_DMA_ELEMENTS,
                     UDMA_SIZE_32, UDMA_ARB_8,(void *)CAM_BUFFER_ADDR,
                     UDMA_SRC_INC_32, (void *)p_buffer, UDMA_DST_INC_32);
    //
    //  Ping Buffer
    // 
    p_buffer += TOTAL_DMA_ELEMENTS; 

    g_dma_txn_done = 0;
    g_frame_size_in_bytes = 0;
    g_frame_end = 0;
    g_total_dma_intrpts = 0;

    //
    // Clear any pending interrupt
    //
    HWREG(0x4402609C) |= 1 << 8;

    //
    // DMA Interrupt unmask from apps config
    //
    HWREG(0x44026094) |= 1 << 8;
}

//*****************************************************************************
//
//!     Camera Controller Initialisation 
//!    
//!	\param                      None  
//!     \return                     None
//!                               
//
//*****************************************************************************

static void CamControllerInit()
{
    MAP_PRCMPeripheralClkEnable(PRCM_CAMERA, PRCM_RUN_MODE_CLK);
    MAP_PRCMPeripheralReset(PRCM_CAMERA);

#ifndef ENABLE_JPEG
    // Configure Camera clock from ARCM
    // CamClkIn = ((240)/((1+1)+(1+1))) = 60 MHz
    HWREG(0x44025000) = 0x0101;
#else
    HWREG(0x44025000) = 0x0000;
#endif 

