polybassa/WyLight/cc3200/example/camera_application/camera_app.c
    MAP_CameraReset(CAMERA_BASE);

#ifndef ENABLE_JPEG
    MAP_CameraParamsConfig(CAMERA_BASE, CAM_HS_POL_HI, CAM_VS_POL_HI,
                       CAM_ORDERCAM_SWAP|CAM_NOBT_SYNCHRO);
#else
    MAP_CameraParamsConfig(CAMERA_BASE, CAM_HS_POL_HI,CAM_VS_POL_HI,
                       CAM_NOBT_SYNCHRO|CAM_IF_SYNCHRO|CAM_BT_CORRECT_EN);
#endif 

    MAP_CameraIntRegister(CAMERA_BASE, CameraIntHandler);

#ifndef ENABLE_JPEG
    MAP_CameraXClkConfig(CAMERA_BASE, 60000000,3750000);
#else
    MAP_CameraXClkConfig(CAMERA_BASE, 120000000,24000000);
#endif 

    MAP_CameraThresholdSet(CAMERA_BASE, 8);
    MAP_CameraIntEnable(CAMERA_BASE, CAM_INT_FE);
    MAP_CameraDMAEnable(CAMERA_BASE);
}


//*****************************************************************************
//
//!     Camera Interrupt Handler
//!    
//!	\param                      None  
//!     \return                     None                              
//
//*****************************************************************************
static void CameraIntHandler()
{
    if(g_total_dma_intrpts > 1 && MAP_CameraIntStatus(CAMERA_BASE) & CAM_INT_FE)
    {
        MAP_CameraIntClear(CAMERA_BASE, CAM_INT_FE);
        g_frame_end = 1;
        MAP_CameraCaptureStop(CAMERA_BASE, true);
    }

    if(HWREG(0x440260A4) & (1<<8))
    {
        // Camera DMA Done clear
        HWREG(0x4402609C) |= 1 << 8;

        g_total_dma_intrpts++;

        g_frame_size_in_bytes += (TOTAL_DMA_ELEMENTS*sizeof(unsigned long));
        if(g_frame_size_in_bytes < FRAME_SIZE_IN_BYTES && 
                                    g_frame_size_in_bytes < IMAGE_BUF_SIZE)
        {
            if(g_dma_txn_done == 0)
            {
                DMASetupTransfer(UDMA_CH22_CAMERA,UDMA_MODE_PINGPONG,
                                 TOTAL_DMA_ELEMENTS,UDMA_SIZE_32,
                                 UDMA_ARB_8,(void *)CAM_BUFFER_ADDR, 
                                 UDMA_SRC_INC_32,
                                 (void *)p_buffer, UDMA_DST_INC_32);
                p_buffer += TOTAL_DMA_ELEMENTS;
                g_dma_txn_done = 1;
            }
            else
            {
                DMASetupTransfer(UDMA_CH22_CAMERA|UDMA_ALT_SELECT,
                                 UDMA_MODE_PINGPONG,TOTAL_DMA_ELEMENTS,
                                 UDMA_SIZE_32, UDMA_ARB_8,
                                 (void *)CAM_BUFFER_ADDR,
                                 UDMA_SRC_INC_32, (void *)p_buffer, 
                                 UDMA_DST_INC_32);
                p_buffer += TOTAL_DMA_ELEMENTS;
                g_dma_txn_done = 0;
            }
        }
        else
        {
            // Disable DMA 
            MAP_UtilsDelay(20000);
            MAP_uDMAChannelDisable(UDMA_CH22_CAMERA);
            HWREG(0x44026090) |= 1 << 8;
            g_frame_end = 1;
        }
    }
}

//*****************************************************************************
//
//!     JfifApp0Marker 
//!    
//!	\param                      Pointer to the output buffer  
//!     \return                     Length of the Marker                        
//
//*****************************************************************************

#ifdef ENABLE_JPEG
static int JfifApp0Marker(char *pbuf)
{
    *pbuf++= 0xFF;                  // APP0 marker 
    *pbuf++= 0xE0;
    *pbuf++= 0x00;                  // length 
    *pbuf++= 0x10;
    *pbuf++= 0x4A;                  // JFIF identifier 
    *pbuf++= 0x46;
    *pbuf++= 0x49;
    *pbuf++= 0x46;
    *pbuf++= 0x00;
    *pbuf++= 0x01;                  // version 
    *pbuf++= 0x02;
    *pbuf++= 0x00;                  // units 
    *pbuf++= 0x00;                  // X density 
    *pbuf++= 0x01;
    *pbuf++= 0x00;                  // Y density 
    *pbuf++= 0x01;
    *pbuf++= 0x00;                  // X thumbnail 
    *pbuf++= 0x00;                  // Y thumbnail 
    return 18;
}


//*****************************************************************************
//
//!    FrameHeaderMarker
//!    
//!	\param1                      pointer to the output buffer  
//!	\param2                      width   
//!	\param3                      height 
//!	\param4                      format
//!
//!     \return                       Length of the header marker                       
//
//*****************************************************************************
static int FrameHeaderMarker(char *pbuf, int width, int height, int format)
{
    int length;
    if (format == FORMAT_MONOCHROME)
        length = 11;
    else
        length = 17;

    *pbuf++= 0xFF;                      // start of frame: baseline DCT 
    *pbuf++= 0xC0;
    *pbuf++= length>>8;                 // length field 
    *pbuf++= length&0xFF;
    *pbuf++= 0x08;                      // sample precision 
    *pbuf++= height>>8;                 // number of lines 
    *pbuf++= height&0xFF;
    *pbuf++= width>>8;                  // number of samples per line 
    *pbuf++= width&0xFF;

    if (format == FORMAT_MONOCHROME)    // monochrome 
    {
        *pbuf++= 0x01;              // number of image components in frame 
        *pbuf++= 0x00;              // component identifier: Y 
        *pbuf++= 0x11;              // horizontal | vertical sampling factor: Y 
        *pbuf++= 0x00;              // quantization table selector: Y 
    }
    else if (format == FORMAT_YCBCR422) // YCbCr422
    {
        *pbuf++= 0x03;        // number of image components in frame 
        *pbuf++= 0x00;        // component identifier: Y 
        *pbuf++= 0x21;        // horizontal | vertical sampling factor: Y 
        *pbuf++= 0x00;        // quantization table selector: Y 
        *pbuf++= 0x01;        // component identifier: Cb 
        *pbuf++= 0x11;        // horizontal | vertical sampling factor: Cb 
        *pbuf++= 0x01;        // quantization table selector: Cb 
        *pbuf++= 0x02;        // component identifier: Cr 
        *pbuf++= 0x11;        // horizontal | vertical sampling factor: Cr 
        *pbuf++= 0x01;        // quantization table selector: Cr 
    }
    else                                // YCbCr420 
    {
        *pbuf++= 0x03;         // number of image components in frame 
        *pbuf++= 0x00;         // component identifier: Y 
        *pbuf++= 0x22;         // horizontal | vertical sampling factor: Y 
        *pbuf++= 0x00;         // quantization table selector: Y 
        *pbuf++= 0x01;         // component identifier: Cb 
        *pbuf++= 0x11;         // horizontal | vertical sampling factor: Cb 
        *pbuf++= 0x01;         // quantization table selector: Cb 
        *pbuf++= 0x02;         // component identifier: Cr 
        *pbuf++= 0x11;         // horizontal | vertical sampling factor: Cr 
        *pbuf++= 0x01;        // quantization table selector: Cr 
    }

    return (length+2);
}


//*****************************************************************************
//
//!     ScanHeaderMarker
//!
//!	\param1                     pointer to output buffer  
//!	\param2                     Format 
//!
//!     \return                     Length                             
//
//*****************************************************************************
static int ScanHeaderMarker(char *pbuf, int format)
{
    int length;
    if (format == FORMAT_MONOCHROME)
        length = 8;
    else
        length = 12;

    *pbuf++= 0xFF;                  // start of scan 
    *pbuf++= 0xDA;
    *pbuf++= length>>8;             // length field 
    *pbuf++= length&0xFF;
    if (format == FORMAT_MONOCHROME)// monochrome 
    {
        *pbuf++= 0x01;              // number of image components in scan 
        *pbuf++= 0x00;              // scan component selector: Y 
        *pbuf++= 0x00;              // DC | AC huffman table selector: Y 
    }
    else                            // YCbCr
    {
        *pbuf++= 0x03;              // number of image components in scan 
        *pbuf++= 0x00;              // scan component selector: Y 
        *pbuf++= 0x00;              // DC | AC huffman table selector: Y 
        *pbuf++= 0x01;              // scan component selector: Cb 
        *pbuf++= 0x11;              // DC | AC huffman table selector: Cb 
        *pbuf++= 0x02;              // scan component selector: Cr 
        *pbuf++= 0x11;              // DC | AC huffman table selector: Cr 
    }

    *pbuf++= 0x00;         // Ss: start of predictor selector 
    *pbuf++= 0x3F;         // Se: end of spectral selector 
    *pbuf++= 0x00;         // Ah | Al: successive approximation bit position 

    return (length+2);
}


//*****************************************************************************
//
//!     DefineQuantizationTableMarker 
//!      Calculate and write the quantisation tables
//! qscale is the customised scaling factor  see MT9D131 developer guide page 78 
//!    
//!	\param1                      pointer to the output buffer  
//!	\param2                      Quantization Scale  
//!	\param3                      Format 
//!
//!     \return                      Length of the Marker                       
//
//*****************************************************************************
static int DefineQuantizationTableMarker (unsigned char *pbuf, int qscale, int format)
{
    int i, length, temp;
	// temp array to store scaled zigzagged quant entries 
    unsigned char newtbl[64];

    if (format == FORMAT_MONOCHROME)    // monochrome 
        length  =  67;
    else
        length  =  132;

    *pbuf++  =  0xFF;                   // define quantization table marker 
    *pbuf++  =  0xDB;
    *pbuf++  =  length>>8;              // length field 
    *pbuf++  =  length&0xFF;
	 // quantization table precision | identifier for luminance 
    *pbuf++  =  0;                     

