polybassa/WyLight/cc3200/example/camera_application/camera_app.c
static int CreateJpegHeader(char *header, int width, int height,
                            int format, int restart_int, int qscale)
{
    char *pbuf = header;
    int length;

    // SOI 
    *pbuf++= 0xFF;
    *pbuf++= 0xD8;
    length = 2;

    // JFIF APP0 
    length += JfifApp0Marker(pbuf);

    // Quantization Tables 
    pbuf = header + length;
    length += DefineQuantizationTableMarker
                                       ((unsigned char *)pbuf, qscale, format);

    // Frame Header 
    pbuf = header + length;
    length += FrameHeaderMarker(pbuf, width, height, format);

    // Huffman Table DC 0 for Luma 
    pbuf = header + length;
    length += DefineHuffmanTableMarkerDC(pbuf, &JPEG_StdHuffmanTbl[352], 0x00);

    // Huffman Table AC 0 for Luma 
    pbuf = header + length;
    length += DefineHuffmanTableMarkerAC(pbuf, &JPEG_StdHuffmanTbl[0], 0x10);

    if (format != FORMAT_MONOCHROME)// YCbCr
    {
        // Huffman Table DC 1 for Chroma 
        pbuf = header + length;
        length += DefineHuffmanTableMarkerDC
                                        (pbuf, &JPEG_StdHuffmanTbl[368], 0x01);

        // Huffman Table AC 1 for Chroma 
        pbuf = header + length;
        length += DefineHuffmanTableMarkerAC
                                        (pbuf, &JPEG_StdHuffmanTbl[176], 0x11);
    }

    // Restart Interval 
    if (restart_int > 0)
    {
        pbuf = header + length;
        length += DefineRestartIntervalMarker(pbuf, restart_int);
    }

    // Scan Header 
    pbuf = header + length;
    length += ScanHeaderMarker(pbuf, format);

    return length;
}
#endif 


//*****************************************************************************
//
//!    ConnectToNetwork 
//!    Setup SimpleLinkin AP Mode
//!    
//!	\param                      None  
//!     \return                     None
//!                               
//
//*****************************************************************************
static void ConnectToNetwork()
{
    //Start Simplelink Device
    g_uiSimplelinkRole =  sl_Start(NULL,NULL,NULL);

    // Device is in AP Mode and Force AP Jumper is not Connected
    if(g_uiSimplelinkRole == ROLE_AP && g_uiDeviceModeConfig == ROLE_STA )
    {
        //Switch to STA Mode
        sl_WlanSetMode(ROLE_AP);
        sl_Stop(10);
        //Clear All Status Bits before SL Start
        CLR_STATUS_BIT_ALL(g_ulStatus);
        g_uiSimplelinkRole =  sl_Start(NULL,NULL,NULL);
    }

    //Device is in STA Mode and Force AP Jumper is Connected
    if(g_uiSimplelinkRole == ROLE_STA && g_uiDeviceModeConfig == ROLE_AP )
    {
        //Switch to AP Mode
        sl_WlanSetMode(ROLE_AP);
        sl_Stop(10);
        //Clear All Status Bits before SL Start
        CLR_STATUS_BIT_ALL(g_ulStatus);
        g_uiSimplelinkRole =  sl_Start(NULL,NULL,NULL);
    }

     //No Mode Change Required
    if(g_uiSimplelinkRole == ROLE_AP)
    {
        //waiting for the AP to acquire IP address from Internal DHCP Server
        while (!IS_IP_ACQUIRED(g_ulStatus))
    	{
            MAP_UtilsDelay(500);
    	}
         //Read the AP SSID
        unsigned char ucAPSSID[AP_SSID_LEN_MAX];
        unsigned short len = 32;
	unsigned short  config_opt = WLAN_AP_OPT_SSID;
        memset(ucAPSSID,'\0',AP_SSID_LEN_MAX);
	sl_WlanGet(SL_WLAN_CFG_AP_ID, &config_opt , &len, (unsigned char*) ucAPSSID);

    }
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
